-- DAY 1. 2020/04/14 (화) 

-- 사원 테이블에서 사원 아이디 조회하기

-- 부서 테이블에서 부서아이디, 부서명 조회하기

-- 잡아이디, 잡타이틀을 조회하기

-- 나라이름 조회하기

-- 사원아이디, 이름, 급여, 연봉, 10%인상된 급여 조회하기

-- 부서아이디, 부서명, 부서담당자 아이디 조회하기

-- 사원아이디, 이름, 급여, 커미션, 커미션이 포함된 급여 조회하기
-- 커미션이 포함된 급여는 급여 + 급여*커미션

-- 중복행없이 조회하기
-- 사원들이 종사하고 있는 직종 아이디를 전부 조회하기

-- 60번 부서에 근무하는 사원의 아이디, 이름, 직종, 급여, 부서아이디를 조회하기

-- 급여를 15000달러 이상 받는 사원의 아이디, 이름, 직종, 급여를 조회하기




-- DAY 2. 2020/04/16 (목)

-- 테이블에서 열을 선택해서 조회하기
-- 사원아이디, 사원명, 직종아이디, 급여 조회하기

-- 직종아이디, 직종의 최소급여, 최대급여 조회하기

-- 지역아이디, 도시명, 주소 조회하기

-- 사원아이디, 사원명, 입사일 조회하기

-- 연산자를 이용하기, 별칭 사용하기
-- 사원아이디, 직종, 급여, 연봉을 조회하고 적절한 별칭 부여하기

-- 사원아이디, 직종, 급여, 시급을 조회하고 적절한 별칭 부여하기, 시급은 급여/(5*24) 이다.

-- 행을 제한해서 조회하기
-- 60번 부서에서 근무하는 사원의 아이디, 이름, 직종, 부서아이디를 조회하기

-- 급여를 5000달러 이하로 받는 사원아이디, 이름, 직종, 급여를 조회하기

-- 100번 직원에게 보고하는 직원의 아이디, 이름 조회하기

-- 100번 직원이 부서담당자로 지정된 부서의 아이디, 부서명을 조회하기

-- 직종 최대 급여가 15000달러 이상 되는 직종의 아이디, 직종제목, 최대급여 조회하기

-- 시급을 100달러 이상 받는 직원의 아이디, 이름, 직종, 급여, 시급을 조회하기

-- 이름이 Neena인 사람의 직원아이디, 이름, 이메일, 전화번호를 조회하기

-- 커미션이 null인 직원의 직원아이디, 이름, 소속부서아이디 확인하기

-- 커미션이 null이 아닌 직원의 직원아이디, 이름, 직종아이디, 소속부서 아이디 조회하기

-- 소속부서를 배정받지 못한 직원의 아이디, 이름, 입사일 조회하기

-- 부서담당자가 지정되지 않은 부서의 아이디, 부서명을 조회하기

-- 부서담당자가 지정된 부서의 부서아이디, 부서명, 담당자 직원아이디 조회하기

-- between a and b 사용하기
-- 급여를 2000이상 3000이하로 받는 사원의 아이디, 이름, 직종, 급여를 조회하기

-- In(값1, 값2, 값3...) 사용하기
-- 10번 부서와 20번 부서에 소속된 사원의 아이디, 이름, 소속부서 아이디 조회하기

-- 50, 60, 70, 80번 부서에 소속되지 않은 사원의 아이디, 이름, 소속부서 아이디 조회하기

-- 국가아이디가 JP, US인 지역의 위치아이디, 주소, 국가아이디 조회하기

-- 직원의 직종아이디가 AD_PRES이거나 AD_VP인 직원의 아이디, 이름, 직종을 조회하기

-- 50번 혹은 60번 부서에 근무한 적이 있는 사원의 아이디, 근무시작일, 근무종료일을 조회하기

-- 101번이나 102번 직원이 상사로 지정된 사원의 아이디, 이름, 매니저아이디를 조회하기

-- 직종아이디가 **_MAN인 직원의 아이디, 이름, 직종아이디, 급여 조회하기

-- 이름이 'A'로 시작하고 이름이 네 글자인 직원의 이름을 전부 조회하기

-- 이름에 'e'가 포함된 직원의 이름을 전부 조회하기

-- 논리 연산자를 사용해서 2개 이상의 조건을 만족하는 행을 조회하기
-- 80번 부서에서 일하는 직원 중 급여가 3000달러 미만인 사원의 아이디, 이름, 급여를 조회하기

-- 50번 부서에서 일하는 직원 중 직종이 매니저인 직원의 직원아이디, 이름, 직종아이디, 급여를 조회하기

-- 50번 부서에서 일하고 급여를 2500불 이하로 받고, 자신의 매니저의 아이디가 121번인 직원의 아이디, 이름, 입사일, 급여, 직종아이디를 조회하기

-- 50번이나 60번 부서에 소속된 직원 중에서 이름이 'A'로 시작하는 직원의 아이디, 이름, 부서아이디를 조회하기

-- 커미션을 받는 직원 중에서 급여를 10000달러 이상 받는 직원의 아이디, 이름, 직종, 입사일, 급여, 연봉을 조회하기
-- 연봉 = 급여*4*12 + 급여*커미션*4*12

-- 정렬하기
-- 60번 부서에 소속된 사원들의 아이디, 이름, 급여, 입사일을 조회하기
-- 이름순으로 오름차순 정렬하기

-- 60번 부서에 소속된 사원들의 아이디, 이름, 급여, 입사일을 조회하기
-- 이름순으로 오름차순 정렬하기

-- 60번 부서에 소속된 사원들의 아이디, 이름, 급여, 입사일을 조회하기
-- 이름순으로 내림차순 정렬하기

-- 60번 부서에 소속된 사원들의 아이디, 이름, 급여, 연봉, 입사일을 조회하기
-- 연봉순으로 오름차순 정렬하기 (ASC는 생략가능)

-- 60번 부서에 소속된 사원들의 아이디, 이름, 급여, 연봉, 입사일을 조회하기
-- 연봉순으로 오름차순 정렬하기

-- 50번 부서에 소속된 직원 중에서 연봉이 25000달러 이상인 직원들의 아이디, 이름, 급여, 연봉, 입사일을 조회하기
-- 연봉순으로 오름차순 정렬하기
-- 실행 시 오류가 발생하는 SQL문

-- 50번 부서에서 근무하는 직원들의 이름, 급여를 조회하고 급여의 내림차순으로 정렬하기
-- 만약 급여가 동일하면 이름의 오름차순으로 정렬하기

-- 단일 행 함수 중 문자 함수 사용하기
-- 사원의 아이디, 이름을 조회하기(이름을 대문자로 표시)

-- DAY 2. Quiz

-- 부서테이블의 모든 부서 정보를 조회하기

-- 부서테이블에서 위치아이디가 1700번이 아닌 부서 정보 조회하기

-- 100사원이 관리하는 부서정보 조회하기

-- 부서명이 'IT'인 부서의 정보 조회하기

-- 위치아이디가 1700번인 지역의 주소, 우편번호, 도시명, 국가코드를 조회하기

-- 최소급여가 2000이상 5000이하인 직종의 직종아이디, 직종제목, 최소급여, 최대급여 조회하기

-- 최대급여가 20000불을 초과하는 직종의 아이디, 직종제목, 최소급여, 최대급여 조회하기

-- 100직원에게 보고하는 사원의 아이디, 이름, 부서아이디을 조회하기

-- 80번 부서에서 근무하고 급여를 8000불 이상 받는 사원의 아이디, 이름, 급여, 커미션포인트 조회하기

-- 직종이 SA_REP이고, 커미션포인트가 0.25이상인 사원의 아이디, 이름, 급여, 커미션포인트를 조회하기

-- 80번 부서에 근무하고, 급여가 10000불 이상인 사원의 아이디, 이름, 급여, 연봉을 조회하기
--    연봉 = (급여 + 급여*커미션)*12다
--   연봉의 별칭은 annual_salary다.

-- 80번 부서에 근무하고, 147번 직원에게 보고하는 사원 중에서 커미션이 0.1인 사원의 
--    사원아이디, 이름, 직종, 급여, 커미션포인트를 조회하기

-- 사원들이 수행하는 직종을 중복없이 조회하기

-- 사원들이 소속된 부서아이디를 모두 조회하기

-- 급여가 12000을 넘는 사원의 이름과 급여를 조회하기

-- 급여가 5000이상 12000이하인 사원의 이름과 급여를 조회하기

-- 20과 50번 부서에 소속된 사원의 이름과 부서번호를 조회하고, 이름을 알파벳순으로 정렬해서  조회하기

-- 급여가 5000이상 12000이하고, 20번과 50번 부서에 소속된 사원의 이름과 급여, 부서번호를 조회하기

-- 관리자가 없는 사원의 이름과 직종, 급여를 조회하기

-- 직종이 'SA_MAN'이거나 'ST_MAN'인 직원중에서 급여를 8000이상 받는 사원의 아이디, 이름, 직종, 급여를 조회하기




-- DAY 3. 2020/04/17 (금)

-- 자바에서는 덧셈기호가 이어붙이기로 동작했지만 oracle에서는 ||가 이어붙이는 기호다.
-- concat 보다 좋은 점 : ||는 다수의 문자를 이어붙일 수 있어서 공백을 줄 수도 있음.

-- 연산절을 select에 적을 때, where 조건절 없이 적으면 행에 대한 제한이 없음
-- 그러면 그 테이블에 있는 모든 행을 가져오는데, 값은 우리가 지정한 연산식의 결과를 표시하게 된다.

-- 그래서 oracle에서는 1행1열짜리 테이블인 dual을 만들어 둠 (column dummy, 값은 x)
-- 이 테이블은 내가 뭔가 계산 결과를 한 번만 나타내보고 싶을 때 사용하는 테이블(엄청 많이 사용됨)

-- 주소에서 앞부분만 잘라서 출력하기

-- 숫자함수

-- 직원들의 시급을 조회하기
-- 직원아이디, 이름, 직종아이디, 급여, 시급
-- 시급 = 급여*환율/40, 시급은 원단위까지만 표시한다

-- 나머지값 구하기

-- 날짜 함수
-- 현재 날짜와 시간정보 조회하기

-- 직원아이디, 직원명, 입사일, 오늘까지 근무한 날짜

-- 오늘, 3일전, 1주일전, 1개월전, 3개월전

-- 60번 부서에 소속된 사원들의 아이디, 이름, 입사일, 근무한 개월수를 조회하기
-- 개월수는 소수점부분을 버린다.

-- 오늘부터 3개월 후의 날짜는?

-- 오늘부터 1년 전의 날짜는

-- 날짜 반올림하기, 버리기

-- 두 날짜의 일수 계산하기
-- 현재 날짜에 대해 trunc() 함수로 시분초를 모두 0으로 만들어서 날짜 연산을 했다.

-- 이번달의 마지막 날 조회하기

-- 오늘을 기준으로 다음 번 토요일
-- next_day(기준날짜, 요일번호) : 다음 특정한 요일이 언제인지를 알려 주는 함수
-- 요일번호는 1~7(일요일~토요일)

-- 오늘을 기준으로 다음 번 금요일

-- 오늘을 기준으로 다음 번 일요일

-- 변환 함수
-- 날짜를 문자로 변환하기

-- 2003년도에 입사한 사원의 아이디, 이름, 입사일 조회

-- 입사일이 오늘 날짜와 같은 날짜에 입사한 직원의 아이디, 이름, 입사일 조회하기

-- 특정날짜를 나타내는 문자를 날짜(DATE타입)로 변환하기

-- 특정날짜를 나타내는 문자를 날짜로 변환해서 오늘까지의 일수, 개월수를 조회하기

-- 2005-01-01 ~ 2005-03-31 사이에 입사한 사람의 아이디, 이름, 입사일, 직종아이디 조회하기

-- between으로 해보기

-- 2003년에 입사한 직원의 아이디, 이름, 입사일 조회
-- where 조건식에 쓰는 내용은 가능하면 왼쪽은 원래 값 그대로 두고 오른쪽을 가공해서 사용
-- to_char(hire_date, 'yyyy') = '2003' 이런 식으로 쓰지 말라는 것
-- 왼쪽은 hire_date 그대로 두고 오른쪽을 가공

-- 숫자를 천단위마다 구분자를 포함시켜 조회하기

-- 숫자를 소수점 2자리에서 반올림한 후 텍스트로 변환해 조회하기

-- 문자를 숫자로 변환해서 사용하기
-- 급여가 15000달러 이상인 직원의 아이디, 이름, 급여를 조회하기
-- to_number를 사용해도 되지만 '숫자' 형태 그대로 사용해도 됨(대체로 이렇게 씀)
-- 묵시적 형 변환이 일어났다고 표현한다.

-- to_number를 사용한 경우(정상작동)

-- 숫자에 ,가 들어간 형태로 표현이 되어있을 수 있음. 
-- 이럴 때만 to_number를 사용 (이 경우에는 반드시 to_number를 사용해야 함)

-- 날짜도 숫자와 마찬가지로 묵시적 형 변환이 가능하다.

-- NVL 함수

-- 직원아이디, 이름, 급여, 커미션을 조회하기
-- 커미션값이 null인 경우 0으로 조회한다.

-- 직원아이디, 이름, 실급여를 조회하기
-- 실급여 = 급여 + 급여*커미션이다.

-- 부서아이디, 부서명, 해당부서 관리자 아이디를 조회하기
-- 관리자 아이디가 null인 경우 '지정된 관리자 없음'으로 조회하기

-- 부서아이디, 부서명, 해당부서 관리자 아이디를 조회하기
-- 관리자 아이디가 null인 경우 100번 직원(사장)을 관리자로 지정한다.

-- nvl2() 함수 사용하기

-- 직원아이디, 이름, 커미션 수령여부를 'yes', 'no'로 조회하기

-- case ~ when 
-- 직원아이디, 이름, 급여, 급여등급 조회하기
-- 급여등급은
-- 20000달러 이상 A
-- 10000달러 이상 B
-- 5000 달러 이상 C
-- 그 외는 D

-- case~when
-- 직원아이디, 이름, 급여, 인상된 급여 조회하기
-- 급여 인상은
-- 20000달러 이상 10%
-- 10000달러 이상 15%
-- 5000달러 이상 20%
-- 그외 25%

-- decode()함수를 사용해서 조회하기
-- decode() 안에 decode() 쓰기
-- 직원아이디, 이름, 급여, 급여등급 조회하기
-- 인상률
-- 20000 달러 이상 A
-- 10000 달러 이상 B
-- 5000 달러 이상 C
-- 그외 D




-- DAY 4. 2020/04/20 (월)

-- 급여를 3000달러 받는 사원의 아이디, 이름, 직종아이디, 소속부서아이디, 소속부서명을 조회

-- 급여를 15000달러 이상 받은 직원의 직원아이디, 이름,급여, 직종아이디, 직종제목, 직종최저급여, 직종최대급여 조회하기

-- 부서관리자가 지정된 부서의 부서아이디, 부서명, 도시명, 우편번호, 주소 조회하기

-- 관리자가 지정된 부서의 부서아이디, 부서명, 관리자아이디, 관리자 이름을 조회하기

-- 3개 이상의 테이블 조인하기
-- 급여를 12000이상 받은 사원의 사원아이디, 이름, 급여, 직종아이디, 직종제목, 소속부서아이디, 소속부서명을 조회하기

-- 부서 관리자가 지정된 부서의 부서아이디, 부서명, 관리자의 직원아이디, 직원명, 위치아이디, 도시명, 주소 조회하기

-- 부서 관리자가 지정된 부서의 부서아이디, 부서명, 위치아이디, 도시명, 주소, 국가아이디, 국가명 조회하기

-- Seattle에서 근무하는 직원의 아이디, 이름, 직종, 소속부서 아이디, 소속부서명을 조회하기

-- 직종 변경 이력에서
-- 직원아이디, 직원이름, 업무시작일, 업무종료일, 직종아이디, 직종제목, 소속부서아이디, 부서명 조회하기

-- 비등가 조인
-- 50번 부서에 소속된 직원의 급여 등급을 조회하기
-- 직원아이디, 이름, 급여, 급여 등급

-- 직종별 최저/최고급여의 등급 조회하기

-- DAY 4. Quiz

-- 1.  시스템의 현재 날짜와 시간 조회하기 (dual 사용)

-- 2.  급여를 5000달러 이상 받고, 2005년에 입사한 직원의 아이디, 이름, 급여, 입사일을 조회하기

-- 3.  이름에 e나 E가 포함된 직원 중에서 급여를 10000달러 이상 받는 직원의 아이디, 이름, 급여를 조회하기

-- 4.  입사년도와 상관없이 4월에 입사한 직원들의 아이디, 이름, 입사일을 조회하기

-- 5.  2006년 상반기(1/1 ~ 6/30)에 입사한 직원들의 아이디, 이름, 입사일 조회하기

-- 6.  50번 부서에 소속된 직원들의 급여를 13%인상시키려고 한다.
--     직원아이디, 이름, 현재 급여, 인상된 급여를 조회하기
--     인상된 급여는 소숫점 이하는 버린다.

-- 7.  50번 부서에 소속된 직원들의 급여를 조회하려고 한다.
--     직원 아이디, 이름, 급여 그리고, 급여 1000달러당 *를 하나씩 표시하라.
--     120 Matthew 8000 ********
--     122 Shanta  6500 ******

-- 8.  관리자가 지정되어 있지 않는 부서의 
--     부서아이디, 부서명, 위치아이디, 도시명, 주소를 조회하기

-- 9.  'Executive' 부서에 소속된 직원의 직원아이디, 이름, 직종, 급여를 조회하기

-- 10. 100번 직원이 부서관리자로 지정된 부서에 소속된 직원의 직원아이디, 이름, 직종, 급여를 조회하기

-- 11. 10, 20, 30번 부서에 소속된 직원들의 직원아이디, 이름, 급여, 급여등급을 조회하기

-- 12. 직원들의 직종정보를 참고했을 때 자신이 종사하고 있는 직종의 최저급여를 받고 있는
--     직원의 아이디, 이름, 급여, 직종아이디, 직종최저급여를 조회하기

-- 13. 커미션을 받는 직원들의 직원아이디, 이름, 커미션, 급여, 직종아이디, 직종제목, 소속부서 아이디, 부서명을 조회하기

-- 14. 'Canada'에서 근무하고 있는 직원의 아이디, 이름, 소속부서 아이디, 소속부서명, 위치 아이디, 도시명, 주소를 조회하기

-- 15. 모든 직원의 직원아이디, 이름, 직종아이디, 직종제목, 급여, 급여등급, 소속부서 아이디, 소속부서명, 도시명을 조회하기

-- 16. 급여를 5000달러 이하로 받는 직원들의 아이디, 이름, 직종, 소속부서 아이디, 소속부서명, 소속부서 관리자 직원아이디, 
--     소속부서 관리자 직원이름을 조회하기

-- 17. 'Asia'지역에 소재지를 두고 있는 부서의 아이디, 부서명, 부서관리자 이름을 조회하기

-- 18. 101번 직원이 근무했던 부서에서 근무중이 직원의 아이디, 이름, 부서아이디, 부서명을 조회하기

-- 19. 직원중에서 자신이 종사하고 있는 직종의 최고급여 50%이상을 급여로 받고 있는 
--     직원의 아이디, 이름, 급여, 직종아이디, 직종 최고급여를 조회하기

-- 20. 미국(US)에 위치하고 있는 부서의 아이디, 이름, 위치번호, 도시명, 주소를 조회하기 




-- DAY 5. 2020/04/21 (화)
